# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs, fixed to YOLOv8m scale


# YOLOv8m backbone
backbone:
  - [-1, 1, Conv, [48, 3, 2]]  
  - [-1, 1, Conv, [96, 3, 2]]  
  - [-1, 2, C2f, [96, True]]  
  - [-1, 1, Conv, [192, 3, 2]]  
  - [-1, 4, C2f, [192, True]]  
  - [-1, 1, Conv, [384, 3, 2]] 
  - [-1, 4, C2f, [384, True]]  
  - [-1, 1, Conv, [512, 3, 2]] 
  - [-1, 2, C2f, [512, True]]
  - [-1, 1, SPPF, [512, 5]]

# YOLOv8m head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [384]] 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [192]] 

  - [-1, 1, Conv, [192, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [384]]

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]  

  - [[15, 18, 21], 1, Detect, [nc]]  